In [5]:
# import necessary libraries


import pandas as pd
import numpy as np

# 1.Split Spring

In [7]:
name="Hey! I am Vishal Guna"
s=name.split()
s

['Hey!', 'I', 'am', 'Vishal', 'Guna']

# 2. Formatted String

In [10]:
name = "Vishal Guna"
department= "CSE"
print("Hi I am {name} from {department} department.".format(name=name, department=department))

Hi I am Sabarisshan G K from CSE department.

# 3. Extract hello from nested dictionary

In [11]:

nested_dictionary = {"k1":[1,2,3,
                   {"tricky":["oh","man","inception",
                              {"target":[1,2,3,"hello"]
                              }]}]
            }

print(nested_dictionary["k1"][3]["tricky"][3]["target"][3])

hello

# Numpy

4.1 Create an array of zeros

In [12]:
numpy_12 = np.zeros(12)
numpy_12

array([0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 0.])

numpy_12 = np.zeros(12)
numpy_12

In [13]:
np_even = np.arange(10,61,2)
np_even

array([10, 12, 14, 16, 18, 20, 22, 24, 26, 28, 30, 32, 34, 36, 38, 40, 42,
       44, 46, 48, 50, 52, 54, 56, 58, 60])

In [ ]:
6. Create a 3x3 matrix

In [ ]:
np_3d = np.arange(0,9).reshape(3,3)
np_3d

7.Concatenate two array

In [14]:
7.Concatenate two array7.Concatenate two array

array([1, 2, 3, 4, 5, 6])

8.Create a dataframe with 3 rows and 2 columns

In [15]:
rand_num = np.random.randint(10,size=(3,2))
df = pd.DataFrame(rand_num,columns=["row1","row2"])
df

   row1  row2
0     4     4
1     2     5
2     9     9

In [16]:
pd_dict = {
    "col_1":[1,2,3],
    "col_2":[2,5,6]
          }
# Create dataframe by dictionary
df = pd.DataFrame(pd_dict)
df

   col_1  col_2
0      1      2
1      2      5
2      3      6

In [18]:
# Add dataframe by list 
name_list = ["Vishal",20],["VEMBU",20],["Hema",20],["Sabari",19]
df = pd.DataFrame(name_list,columns=["Name","Age"])
df

     Name  Age
0  Vishal   20
1   VEMBU   20
2    Hema   20
3  Sabari   19

In [21]:
# dataframe Generator 
df = pd.DataFrame()

df["time"] = pd.date_range(start ="1/1/2023",end ="2/10/2023",freq ="24H")

df["year"] =df["time"].dt.year
df["month"] = df["time"].dt.month
df["day"] = df["time"].dt.day

In [22]:
df.head()

        time  year  month  day
0 2023-01-01  2023      1    1
1 2023-01-02  2023      1    2
2 2023-01-03  2023      1    3
3 2023-01-04  2023      1    4
4 2023-01-05  2023      1    5

10. Create 2D list to dataframe

In [23]:
list_2d = [[1,"aaa",22],[2,"bbb",25],[3,"ccc",24]]
df = pd.DataFrame(list_2d,columns=["col1","col2","col3"])
df

   col1 col2  col3
0     1  aaa    22
1     2  bbb    25
2     3  ccc    24